dlhsok/embedded/九轴气压模块资料/STM32测试程序/串口输出HMC5883L+ADXL345+BMP085+L3G4200D/串口/SRC/main.c
USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;		  // 发送使能+接收使能
/* Configure USART1 basic and asynchronous paramters */
USART_Init(USART1, &USART_InitStructure);
    
  /* Enable USART1 */
USART_ClearFlag(USART1, USART_IT_RXNE); 			//清中断，以免一启用中断后立即产生中断
USART_ITConfig(USART1,USART_IT_RXNE, ENABLE);		//使能USART1中断源
USART_Cmd(USART1, ENABLE);							//USART1总开关：开启 
}


/*
********************************************************************************
** 函数名称 ： NVIC_Configuration(void)
** 函数功能 ： 中断初始化
** 输    入	： 无
** 输    出	： 无
** 返    回	： 无
********************************************************************************
*/
void NVIC_Configuration(void)
{ 
  NVIC_InitTypeDef NVIC_InitStructure;  
  NVIC_PriorityGroupConfig(NVIC_PriorityGroup_0); 
 
  NVIC_InitStructure.NVIC_IRQChannel = WWDG_IRQChannel;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_Init(&NVIC_InitStructure);

}

 /*
********************************************************************************
** 函数名称 ： WWDG_Configuration(void)
** 函数功能 ： 看门狗初始化
** 输    入	： 无
** 输    出	： 无
** 返    回	： 无
********************************************************************************
*/
void WWDG_Configuration(void)
{
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_WWDG, ENABLE);	
  WWDG_SetPrescaler(WWDG_Prescaler_8);	              //  WWDG clock counter = (PCLK1/4096)/8 = 244 Hz (~4 ms)  
  WWDG_SetWindowValue(0x41);		                 // Set Window value to 0x41
  WWDG_Enable(0x50);		       // Enable WWDG and set counter value to 0x7F, WWDG timeout = ~4 ms * 64 = 262 ms 
  WWDG_ClearFlag();			       // Clear EWI flag
  WWDG_EnableIT();			       // Enable EW interrupt
}

/*
********************************************************************************
** 函数名称 ： Delay(vu32 nCount)
** 函数功能 ： 延时函数
** 输    入	： 无
** 输    出	： 无
** 返    回	： 无
********************************************************************************
*/
 void Delay(vu32 nCount)
{
  for(; nCount != 0; nCount--);
}

/*
********************************************************************************
** 函数名称 ： void Delayms(vu32 m)
** 函数功能 ： 长延时函数	 m=1,延时1ms
** 输    入	： 无
** 输    出	： 无
** 返    回	： 无
********************************************************************************
*/
 void Delayms(vu32 m)
{
  u32 i;
  
  for(; m != 0; m--)	
       for (i=0; i<50000; i++);
}



/*
********************************************************************************
** 函数名称 ： WWDG_IRQHandler(void)
** 函数功能 ： 窗口提前唤醒中断
** 输    入	： 无
** 输    出	： 无
** 返    回	： 无
********************************************************************************
*/ 

void WWDG_IRQHandler(void)
{
  /* Update WWDG counter */
  WWDG_SetCounter(0x50);
	
  /* Clear EWI flag */
  WWDG_ClearFlag();
  
}
 //************************************************
void  USART1_SendData(uchar SendData)
{
USART_SendData(USART1, SendData);
Delayms(1);
}
	

//********************************************************************
long bmp085ReadTemp(void)
{   short  temp_ut;
	Single_Write(BMP085_Addr,0xF4,0x2E);
	Delayms(5);	// max time is 4.5ms
	temp_ut = Single_Read(BMP085_Addr,0xF6);
	temp_ut = (temp_ut<<8)| Single_Read(BMP085_Addr,0xF7);		
	return (long) temp_ut ;
}
//*************************************************************

long bmp085ReadPressure(void)
{
	long pressure = 0;
	Single_Write(BMP085_Addr,0xF4,0x34);
	Delayms(5);	// max time is 4.5ms
	pressure = Single_Read(BMP085_Addr,0xF6);
	pressure = (pressure<<8)| Single_Read(BMP085_Addr,0xF7);		
	pressure &= 0x0000FFFF;	
	return pressure;	
}

 //******************
 Send_ADXL345_data(int dis_data)
  { float temp ;
	if(dis_data>0x7fff)dis_data-=0xffff;
 	if(dis_data<0){
  	     dis_data=-dis_data;
	     USART_SendData(USART1,'-');
		 Delayms(2);
	}
	else
	  { 
	   USART_SendData(USART1,'+');
	   Delayms(2);
	   }
        temp=(float)dis_data*3.9;  //计算数据和显示,查考ADXL345快速入门第4页
        conversion(temp);          //转换出显示需要的数据	 
	    USART1_SendData(qian);
		USART1_SendData('.');
	    USART1_SendData(bai); 
	    USART1_SendData(shi); 
	    USART1_SendData(ge); 
		USART1_SendData('g'); 
}
//***************************************
 //******************
 Send_L3G420D_data(short dis_data)
  { float temp ;
 	if(dis_data<0){
  	     dis_data=-dis_data;
	     USART_SendData(USART1,'-');
		 Delayms(2);
	}
	else
	  { 
	   USART_SendData(USART1,'+');
	   Delayms(2);
	   }
        temp=(float)dis_data*0.07;  //计算数据和显示,查考ADXL345快速入门第4页
        conversion(temp);           //转换出显示需要的数据	 
	    USART1_SendData(bai); 
	    USART1_SendData(shi); 
	    USART1_SendData(ge); 
 
}
//***************************************


void Send_HMC5883L()
{
USART1_SendData('H');
USART1_SendData('M');
USART1_SendData('C');
USART1_SendData('5');
USART1_SendData('8');
USART1_SendData('8');
USART1_SendData('3');
USART1_SendData('L');
USART1_SendData(':');
conversion(angle);
USART1_SendData(bai); 
USART1_SendData(shi); 
USART1_SendData(ge); 
USART1_SendData('`');  
USART1_SendData(0x0d);
USART1_SendData(0x0a);
}
//*************************************************
void  Send_BMP085()
{
USART1_SendData('B');
USART1_SendData('M');
USART1_SendData('P');
USART1_SendData('0');
USART1_SendData('8');
USART1_SendData('5');
USART1_SendData(':');

USART1_SendData('t');
USART1_SendData('=');
conversion(temperature);
USART1_SendData(bai); 
USART1_SendData(shi); 
USART1_SendData('.');
USART1_SendData(ge);
USART1_SendData('`'); 
USART1_SendData('C'); 

USART1_SendData(' ');
USART1_SendData('p');
USART1_SendData('=');
conversion(pressure);

USART1_SendData(shiwan);
USART1_SendData(wan);
USART1_SendData(qian);
USART1_SendData('.');
USART1_SendData(bai); 
USART1_SendData(shi); 
USART1_SendData(ge); 
USART1_SendData('K'); 
USART1_SendData('p'); 
USART1_SendData('a');  				
USART1_SendData(0x0d);
USART1_SendData(0x0a);

}
//*****************************************************

void  Send_ADXL345()
{
USART1_SendData('A');
USART1_SendData('D');
USART1_SendData('X');
USART1_SendData('L');
USART1_SendData('3');
USART1_SendData('4');
USART1_SendData('5');
USART1_SendData(':');
	   USART1_SendData('X');
	   USART1_SendData('=');
	   Send_ADXL345_data(A_X);

	   USART1_SendData('Y');
	   USART1_SendData('=');
	   Send_ADXL345_data(A_Y);

